In [1]:
!type examples\ex1.csv  #windows命令改变两个地方 1、cat->type  2、"/"换成"\"

examples\ex1.csv


系统找不到指定的文件。
处理: #windows命令改变两个地方 时出错。
系统找不到指定的文件。
处理: 1、cat- 时出错。
参数错误。

In [2]:
import pandas as pd
df = pd.read_csv('examples\ex1.csv')

In [3]:
pd.read_table('examples\ex1.csv',sep=',')

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [5]:
pd.read_csv('examples\ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('examples\ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
names = ['a','b','c','d','message']

In [8]:
pd.read_csv('examples\ex2.csv',names=names,index_col='message') #index_col意思？放在索引4？

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [10]:
parsed = pd.read_csv('examples\csv_mindex.csv',index_col=['key1','key2'])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
list(open('examples\ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [13]:
result = pd.read_table('examples\ex3.txt',sep='\s+') #正则表达式作为分隔符是什么意思

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [14]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
pd.read_csv('examples\ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [18]:
pd.read_csv('examples\ex5.csv')

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
pd.isnull(result)

         A      B      C
aaa  False  False  False
bbb  False  False  False
ccc  False  False  False
ddd  False  False  False

In [20]:
result=pd.read_csv('examples\ex5.csv',na_values=['NULL'])  #含义？

In [21]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
sentinels = {'message':['foo','NA'],'something':['one']}

In [23]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
pd.read_csv('examples\ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [25]:
pd.options.display.max_rows=10

In [26]:
result = pd.read_csv('examples\ex6.csv')

In [27]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [31]:
chunker = pd.read_csv('examples\ex6.csv',chunksize=1000)

In [32]:
chunker

In [33]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)  #add形式？value_counts()含义？？？
tot = tot.sort_values(ascending=False)

In [34]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [36]:
data = pd.read_csv('examples\ex5.csv')

In [37]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
data.to_csv('examples\out.csv')

In [39]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [40]:
import sys
data.to_csv(sys.stdout,sep='|')  #写出到sys.stdout

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [41]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [42]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout,index=False,columns=['a','b','d'])

a,b,d
1,2,4
5,6,8
9,10,12

In [50]:
dates = pd.date_range('1/1/2000',periods=7)

In [52]:
import numpy as np
ts = pd.Series(np.arange(7),index = dates)

In [53]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [56]:
ts.to_csv('examples/tseries.csv')

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [57]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [58]:
!type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [59]:
import csv

In [60]:
f = open('examples\ex7.csv')

In [61]:
reader = csv.reader(f)

In [62]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [65]:
with open('examples\ex7.csv') as f:  #with语法？
    lines = list(csv.reader(f))

In [66]:
header,values = lines[0],lines[1:]

In [67]:
data_dict = {h: v  for h,v in zip(header,zip(*values))}

In [68]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [69]:
class my_dialect(csv.Dialect):
    lineterminater='\n'
    delimiter=','
    quotechar=''''
    quoting=csv.QUOTE_MINIMAL    
reader = csv.reader(f,dialect=my_dialect)

SyntaxError: EOF while scanning triple-quoted string literal (<ipython-input-69-83668886e4ea>, line 6)

In [70]:
reader = csv.reader(f,delimiter='|')

TypeError: argument 1 must be an iterator

In [88]:
import json

In [112]:
obj = """
{"name": "Wes",
"places_lived":["United States", "Spain", "Germany"],
"pet":null,
"siblings":[{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name":"Katie", "age": 38,"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [113]:
result = json.loads(obj)

In [114]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [119]:
ajson = json.dumps(result)
siblings = pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [120]:
!type examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [121]:
data = pd.read_json('examples\example.json')

In [122]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [123]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [124]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [133]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')  #默认搜索网页的表格标签
len(tables)

1

In [135]:
failures = tables[0]

In [137]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [138]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [139]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [140]:
from lxml import objectify

In [142]:
path = 'datasets\mta_perf\Performance_MNR.xml'
parsed = objectify.parse(open(path))  #parse的含义？
root = parsed.getroot()

In [143]:
data = []
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data={}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
            el_data[child.tag] = child.pyval
            data.append(el_data)

In [144]:
perf = pd.DataFrame(data)

In [145]:
perf.head()

Empty DataFrame
Columns: []
Index: []

In [146]:
data

[]

In [148]:
from io import StringIO
tag = '<a href = "http:\\www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [149]:
root

In [150]:
root.get('href')

'http:\\www.google.com'

In [151]:
root.text

'Google'

In [154]:
frame = pd.read_csv('examples\ex1.csv')

In [155]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [161]:
frame.to_pickle('examples/frame_pickle')

In [162]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [165]:
frame = pd.DataFrame({'a':np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1']=frame
store['obj1_col']=frame['a']

In [166]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [167]:
store['obj1']

           a
0   1.342026
1   0.084589
2   0.370864
3   0.925942
4  -1.545499
..       ...
95  1.667701
96 -2.131332
97  1.445522
98  1.949059
99 -0.685426

[100 rows x 1 columns]

In [168]:
store.put('obj2',frame,format = 'table' )

In [170]:
store.select('obj2',where = ['index >= 10 and index <= 15'])

           a
10  0.999343
11  1.254171
12 -1.336312
13  0.768753
14 -0.941901
15 -1.275552

In [171]:
store.close()

In [174]:
frame.to_hdf('mytata.h5','obj3',format = 'table')

In [177]:
pd.read_hdf('mytata.h5','obj3',where=['index <= 5'])

          a
0  1.342026
1  0.084589
2  0.370864
3  0.925942
4 -1.545499
5 -1.074901

In [183]:
xlsx = pd.ExcelFile('examples\ex1.xlsx')

In [185]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [186]:
frame = pd.read_excel('examples\ex1.xlsx','Sheet1')

In [187]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [188]:
writer = pd.ExcelWriter('examples\ex2.xlsx')

In [189]:
frame.to_excel(writer,'Sheet1')

In [190]:
writer.save()  #结果是什么？？

In [192]:
import requests

In [193]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [194]:
resp = requests.get(url)
resp

In [195]:
data = resp.json()

In [196]:
data[0]['title']

'Make pandas.to_parquet handles partition columns better'

In [197]:
issues = pd.DataFrame(data,columns = ['number','title','labels','state'])

In [198]:
issues

,number,title,labels,state
0,27117,Make pandas.to_parquet handles partition colum...,[],open
1,27116,Bump python_requires to 3.5.2,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
2,27114,Decoupled more xlrd reading tests from openpyxl,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
3,27111,TST: openpyxl tests fail if xlrd is not installed,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
4,27110,BUG: Fix indexing on DatetimeBlock,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,27073,ENH: Json fill_value for missing fields,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
26,27072,[POC] CLN: use ExtensionBlock for datetime tz ...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
27,27070,Add semantic analyser,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,27069,Feature request: make read_parquet support rea...,[],open
29,27067,DOC: Exception raised if columns do not match ...,"[{'id': 1049312478, 'node_id': 'MDU6TGFiZWwxMD...",open

In [199]:
import sqlite3

In [200]:
query = """
CREATE TABLE test
(a varchar(20),b varchar(20),
 c REAL,       d  INTEGER );"""

In [205]:
con = sqlite3.connect('mydata.sqlite')

In [206]:
con.execute(query)

In [207]:
con.commit()

In [208]:
data = [('Atlanta','Georgia',1.25,6),
        ('Tallahassee','Florida',2.6,3),
       ('Sacramento','California',1.7,5)]

In [209]:
stmt = "INSERT INTO test VALUES(?,?,?,?) "

In [210]:
con.executemany(stmt,data)

In [211]:
cursor = con.execute('select * from test')

In [212]:
rows = cursor.fetchall()

In [213]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [214]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [216]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [220]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [221]:
pd.read_sql('select * from test',db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []